In [1]:
import pandas as pd
from datetime import datetime
from datetime import date
from datetime import time

In [2]:

df = pd.read_csv('bank_transactions.csv')

# Check Missing Values and Outlier Data

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048567 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1048567 non-null  object
 1   CustomerID               1048567 non-null  object
 2   CustomerDOB              1045170 non-null  object
 3   CustGender               1047467 non-null  object
 4   CustLocation             1048416 non-null  object
 5   CustAccountBalance       1046198 non-null  float64
 6   TransactionDate          1048567 non-null  object
 7   TransactionTime          1048567 non-null  int64
 8   TransactionAmount (INR)  1048567 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 72.0+ MB

In [4]:
df.columns

Index(['TransactionID', 'CustomerID', 'CustomerDOB', 'CustGender',
       'CustLocation', 'CustAccountBalance', 'TransactionDate',
       'TransactionTime', 'TransactionAmount (INR)'],
      dtype='object')

In [5]:
df.dropna(inplace=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041614 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1041614 non-null  object
 1   CustomerID               1041614 non-null  object
 2   CustomerDOB              1041614 non-null  object
 3   CustGender               1041614 non-null  object
 4   CustLocation             1041614 non-null  object
 5   CustAccountBalance       1041614 non-null  float64
 6   TransactionDate          1041614 non-null  object
 7   TransactionTime          1041614 non-null  int64
 8   TransactionAmount (INR)  1041614 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 79.5+ MB

In [7]:
# Checking Customer Date of Birth validity
df['CustomerDOB'] = pd.to_datetime(df['CustomerDOB'])

In [8]:
df['CustomerDOB'].value_counts()

1800-01-01    56292
1989-01-01      809
1990-01-01      784
1991-06-08      698
1991-01-01      665
              ...
2051-02-12        1
2052-03-20        1
2047-09-26        1
2041-04-10        1
2044-10-24        1
Name: CustomerDOB, Length: 17233, dtype: int64

In [9]:
df = df[df['CustomerDOB'] != '1800-01-01']

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 985322 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   TransactionID            985322 non-null  object
 1   CustomerID               985322 non-null  object
 2   CustomerDOB              985322 non-null  datetime64[ns]
 3   CustGender               985322 non-null  object
 4   CustLocation             985322 non-null  object
 5   CustAccountBalance       985322 non-null  float64
 6   TransactionDate          985322 non-null  object
 7   TransactionTime          985322 non-null  int64
 8   TransactionAmount (INR)  985322 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 75.2+ MB

In [11]:
today_date = datetime.now().date()
df = df[df['CustomerDOB'].dt.date <= today_date]

In [12]:
today_year = datetime.now().year
df['Age'] = df['CustomerDOB'].apply(lambda x : today_year - x.year)

In [13]:
# Check Gender Values
df['CustGender'].value_counts()

M    651975
F    249408
Name: CustGender, dtype: int64

In [14]:
# Check Location
df['CustLocation'].value_counts()

MUMBAI                89157
BANGALORE             72259
NEW DELHI             67813
GURGAON               64564
DELHI                 61771
                      ...
(E) THANE SECTOR 3        1
MANIMANGALAM              1
CHINCHINIM                1
PEN DIST RAIGAD           1
IMPERIA THANE WEST        1
Name: CustLocation, Length: 7643, dtype: int64

In [15]:
# Check Account Balance
df['CustAccountBalance'].describe()

count    9.013830e+05
mean     8.175853e+04
std      3.981284e+05
min      0.000000e+00
25%      4.268410e+03
50%      1.479842e+04
75%      4.751663e+04
max      4.316556e+07
Name: CustAccountBalance, dtype: float64

In [16]:
# Checking Transaction Date
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])

In [17]:
df['TransactionDate'].value_counts()

2016-07-08    23952
2016-08-13    23317
2016-06-08    23291
2016-04-09    23224
2016-03-09    23109
2016-10-09    22475
2016-11-09    22223
2016-08-14    21937
2016-08-15    20904
2016-02-09    19949
2016-08-21    19729
2016-01-09    19439
2016-12-08    19378
2016-09-08    18828
2016-08-09    18778
2016-10-08    18742
2016-11-08    18732
2016-09-09    18662
2016-05-09    18426
2016-07-09    18361
2016-05-08    18306
2016-08-27    18227
2016-08-20    18145
2016-08-08    18029
2016-02-08    18023
2016-08-17    18004
2016-08-28    17998
2016-04-08    17855
2016-12-09    17775
2016-09-13    17731
2016-03-08    17665
2016-01-08    17648
2016-08-16    17370
2016-06-09    17005
2016-09-15    16966
2016-09-14    16963
2016-08-31    16739
2016-08-18    16650
2016-08-19    15904
2016-08-22    15819
2016-08-25    15683
2016-08-24    15121
2016-08-26    14991
2016-08-23    14566
2016-08-30    14548
2016-08-29    14095
2016-09-18    12613
2016-09-26    10562
2016-09-25     7114
2016-09-27     6314
2016-09-22     5722
2016-10-21     3133
2016-09-23     2987
2016-09-30     1654
2016-10-16        2
Name: TransactionDate, dtype: int64

In [18]:
df['TransactionDate'].min().date()

datetime.date(2016, 1, 8)

In [19]:
df['TransactionDate'].max().date()

datetime.date(2016, 12, 9)

In [20]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),Age
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0,29
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,142712,459.0,27
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,142714,2060.0,50
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,181156,1762.5,35
6,T7,C7126560,1992-01-26,F,MUMBAI,973.46,2016-02-08,173806,566.0,31

In [21]:
# Checking Transaction Time
df['TransactionTime'] = df['TransactionTime'].apply(lambda x: pd.to_datetime(str(x).zfill(6), format='%H%M%S').time())

In [23]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),Age
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,14:32:07,25.0,29
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,14:27:12,459.0,27
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,14:27:14,2060.0,50
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,18:11:56,1762.5,35
6,T7,C7126560,1992-01-26,F,MUMBAI,973.46,2016-02-08,17:38:06,566.0,31

In [25]:
# Check Transaction Amount
df['TransactionAmount (INR)'].describe()

count    9.013830e+05
mean     1.298580e+03
std      5.475872e+03
min      0.000000e+00
25%      1.480000e+02
50%      4.000000e+02
75%      1.020000e+03
max      1.560035e+06
Name: TransactionAmount (INR), dtype: float64

In [26]:
df.to_csv('cleaned_df.csv', index=False)